emacs/.emacs.d/backups/!usr!local!src!dev!repos!nm!tnm!tools!tnm_load_test!nbi_stuff!get_serviceInventory_batch_req.xml~

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:v11="http://www.tmforum.org/mtop/msi/xsd/sir/v1" xmlns:v12="http://www.tmforum.org/mtop/fmw/xsd/nam/v1">
   <soapenv:Header>
      <v1:header>
      </v1:header>
   </soapenv:Header>
   <soapenv:Body>
      <v11:getServiceInventoryRequest>
      </v11:getServiceInventoryRequest>
   </soapenv:Body>
</soapenv:Envelope>
